int/resources/objectRepo/xmlTemplates/ows/OWSProfileService/req_UpdateComment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://webservices.micros.com/og/4.3/Common/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:UpdateCommentRequest>
         <name:NameID source="?" type="?"/>
         <name:Comment commentTitle="?" commentType="?" externalId="?" globalYn="?" inactiveDate="?" insertDate="?" insertUser="?" internalYn="?" operaId="?" updateDate="?" updateUser="?">
            <com:Text>
               <com:TextElement formatted="?" language="?"/>
            </com:Text>
            <com:Image/>
            <com:Url/>
         </name:Comment>
         <name:ActionType/>
         <name:DueDate/>
      </name:UpdateCommentRequest>
   </soapenv:Body>
</soapenv:Envelope>